-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 04, 2025 at 05:18 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tourism`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `NAME` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `image_url` varchar(255) DEFAULT NULL,
  `latitude` decimal(10,8) NOT NULL,
  `longitude` decimal(11,8) NOT NULL,
  `keywords` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `NAME`, `description`, `image_url`, `latitude`, `longitude`, `keywords`) VALUES
(11, 'อุทยานธรรมเขานาในหลวง', 'เป็นที่ตั้งของ เจดีย์ลอยฟ้า พระพุทธศิลาวดี ก่อสร้างด้วยศิลาแลงจากเมืองกำแพงเพชร บนยอดเขาหินปูนจะอยู่สูงจากพื้นดินเกือบ 300 เมตร เป็นสถานที่ศักดิ์สิทธิ์ที่สงบและร่มเย็นอย่างมาก และชาวสุราษฎร์เองก็ให้ความศรัทธามากๆ อีกด้วย อีกทั้งยังมี ซุ้มประตูพุทธวดี 9 ยอด ที่หากโดนแสงอาทิตย์ส่องลอดเข้ามา จะยิ่งสวยงามมากๆ ทีเดียวเลย', 'img/img3.png', 8.77800700, 98.95512900, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(12, 'วัดพระบรมธาตุไชยา', 'เป็นปูชนียสถานที่สำคัญประจำจังหวัด และเป็นหนึ่งในสามของโบราณสถานอันศักดิ์สิทธิ์ ที่เคารพบูชาของภาคใต้อีกด้วย', 'img/img4.png', 9.38472700, 99.18489600, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(13, 'วัดพระใหญ่\r\n', 'วัดพระใหญ่ หนึ่งใน วัดสวย ที่ตั้งอยู่บน เกาะสมุย เป็นอีกที่เที่ยวชื่อดังที่นิยมมาทำบุญ ไหว้พระ  ภายในวัดประดิษฐาน พระใหญ่ หรือ พระพุทธโคดม สร้างขึ้นตั้งแต่ปี พ.ศ. 2515 เป็นพระพุทธปางมารวิชัย ซึ่งเป็นพระพุทธรูปองค์ใหญ่ที่สุดในภาคใต้อีกด้วย ทั้งชาวเกาะสมุยเอง และนักท่องเที่ยวจะนิยมมาสักการะพระใหญ่เพื่อความเป็นสิริมงคล นอกจากนี้ด้านบน ยังสามารถมองเห็นวิวเกาะพะงัน รวมถึงหาดบ่อผุดได้อีกด้วย', 'img/img5.png', 9.57077300, 100.05988000, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(14, 'วัดปลายแหลม ', 'วัดปลายแหลม หรือ วัดแหลมสุวรรณาราม เป็นอีกที่เที่ยวขึ้นชื่อของ เกาะสมุย สร้างขึ้นในปี พ.ศ.2423 ตั้งอยู่ที่บริเวณปลายแหลมของเกาะสมุย ตามชื่อของวัดเลยค่ะ โดยไฮไลท์ของวัดนี้ ก็คือ อุโบสถ ที่อยู่กลางน้ำ รูปปั้นเจ้าแม่กวนอิมพันมือ และ รูปปั้นพระสังกัจจายน์ เป็นหนึ่งในวัดที่สายบุญ ต้องห้ามพลาดเลย', 'img/img6.png', 9.57139700, 100.06697900, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(15, 'วัดแหลมสอ ', 'วัดแหลมสอ หรือ วัดพระเจดีย์แหลมสอ เป็นวัดที่ตั้งอยู่ริมทะเลแห่งเดียวของ เกาะสมุย โดยมีองค์เจดีย์แหลมสอ เป็นไฮไลท์ ซึ่งเจดีย์นี้เป็นศิลปะในแบบของศรีวิชัย สร้างขึ้นโดย หลวงพ่อแดง ติสโส พระภิกษุที่เป็นที่มีญาณชั้นสูงและเป็นที่เคารพนับถืออย่างมาก ส่วนใหญ่แล้วนักท่องเที่ยวจะนิยมมากราบขอพร พระบรมสารีริกธาตุ ภายในเจดีย์กัน นอกจากนี้วิวสวยๆ ของที่นี่ก็ไม่ธรรมดา เพราะในตอนช่วงพระอาทิตย์ขึ้นนั้น จะเห็นเจดีย์เป็นสีเหลืองทองอร่าม เป็นภาพที่สวยงามมากๆ อีกด้วย', 'img/img7.png', 9.41175000, 99.96902700, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(16, 'วัดทุ่งเซียด', 'วัดทุ่งเซียด ตั้งขึ้นเมื่อปี พ.ศ.2410 เป็นวัดในสมัยกรุงศรีอยุธยา ซึ่งถือว่าเป็นวัดที่เก่าแก่มากๆ เลยทีเดียวโดยที่นี่ก็เปิดเป็นสถานที่ท่องเที่ยวแนวธรรมะ ให้ประชาชนทั่วไปได้มาปฏิบัติธรรม และไหว้พระ ทำบุญกัน นอกจากนี้ยังมีอุโบสถกลางน้ำแบบศิลปะศรีวิชัยแห่งแรกของเมืองไทยอยู่ที่นี่อีกด้วย เป็นวัดสวยใน สุราษฏร์ธานี ที่ต้องมาแวะสักการะสักครั้ง', 'img/img8.png', 9.00026400, 99.17397300, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(17, 'วัดสำเร็จ', 'วัดสำเร็จ เป็นอีกวัดเก่าแก่บน เกาะสมุย สร้างขึ้นในสมัยอยุธยาตอนปลาย มีสถาปัตยกรรมที่สวยงาม ผสมผสานระหว่างไทยและจีน รวมถึงยังมีโบราณสถานและโบราณวัตถุอีกเป็นจำนวนมาก โดยภายในพระวิหารเก่า จะประดิษฐานของพระพุทธรูปปูนปั้นโบราณมากกว่า 50 องค์ ส่วนในพระอุโบสถจะประดิษฐาน พระศิลายวง พระพุทธรูปหยกขาวอันงดงาม ตามแบบศิลปะของเมียนมา ที่มีแค่เพียง 4 องค์เท่านั้นในไทย รวมถึงมี เจดีย์เก่า เจดีย์ในสมัยศรีวิชัย ที่แกะสลักด้วยไม้สักทองทั้งหลัง 1 ใน 3 เจดีย์ที่ขรัวพุทธสรณ์สร้างไว้บนเกาะสมุย', 'img/img9.png', 9.43890800, 100.01143600, 'วัด,พุทธ,ไหว้พระ,ศาสนา'),
(18, 'ศาลเจ้ากวนอูเกาะสมุย\r\n', 'ศาลเจ้ากวนอู  เป็นศาลเจ้าเก่าแก่ของ เกาะสมุย ที่สร้างขึ้นมานานกว่า 150 ปีมาแล้ว โดยไฮไลท์จะอยู่ที่รูปปั้นเนื้อสัมริดของเทพเจ้ากวนอู ที่มีขนาดใหญ่และสูงมากกว่า 16 เมตร รวมไปถึงพื้นที่โดยรอบยังดูสวยงาม คล้ายกับไชน่าทาวน์อีกด้วย ทำให้ที่นี่ได้กลายมาเป็นจุดท่องเที่ยวยอดนิยมของนักท่องเที่ยวที่ไปเกาะสมุยเลย เรียกได้ว่าถ้าไม่ได้แวะไปถ่ายรูป และสักการะบูชาเทพเจ้ากวนอูนั้น ก็จะเหมือนมาไม่ถึงสมุยนั่นเอง', 'img/img10.png', 9.44517400, 100.02481800, ''),
(19, 'ศาลหลักเมือง', 'ศาลหลักเมืองสุราษฎร์ธานี มีความโดดเด่นมาก เพราะตั้งอยู่ใจกลางเมืองใกล้กับแม่น้ำตาปี การเดินทางไปมาสะดวก ทั้งผู้คนที่สัญจรไปมาและชาวจังหวัดสุราษฎร์ธานีที่จะเดินทางมาสักการะด้วย', 'img/img11.png', 9.13912100, 99.32166500, ''),
(20, 'พระธาตุศรีสุราษฎร์', 'พระธาตุศรีสุราษฎร์ สิ่งศักดิ์สิทธิ์คู่บ้านคู่เมือง พระธาตุศรีสุราษฎร์ เป็นปูชนียสถานที่ชาวบ้านได้ร่วมแรงร่วมใจจัดสร้างขึ้น ตั้งอยู่บนยอดเขาท่าเพชร เริ่มก่อสร้างองค์พระธาตุเมื่อ พ.ศ. 2500 เพื่อเป็นที่ระลึกให้แก่แผ่นดินและเป็นสิ่งศักดิ์สิทธิ์คู่บ้านคู่เมือง', 'img/img12.png\r\n', 9.13912100, 99.32166500, ''),
(21, 'วัดสมหวังวนาราม', 'วัดสมหวัง หรือ วัดสมหวังวนาราม มีชาวบ้านได้ร่วมกันบริจาคที่ดินสร้างเป็นที่พำนักสงฆ์และไปนิมนต์ หลวงพ่ออ้วนถิรปัญโญ (พระถัน) จากจังหวัดนครปฐมมาเป็นผู้ดูแล เมื่อท่านมรณภาพ ทำให้ที่พักสงฆ์แห่งนี้มีพระจำพรรษาบ้าง ไม่มีบ้าง เนื่องจากความเป็นอยู่ลำบาก กระทั่งปี พ.ศ. 2524 พระครูโพธิวรสาร หรือหลวงพ่อประมวล โพธิวโร ได้เดินธุดงค์ผ่านมา ชาวบ้านเห็นวัตรปฏิบัติแล้วเกิดเลื่อมใสศรัทธา จึงนิมนต์ให้ท่านอยู่จำพรรษา และได้ร่วมกันบูรณะพัฒนาจนเป็นสำนักสงฆ์', 'img/img13.png', 9.07981400, 99.31211800, ''),
(22, 'เกาะเต่า', 'เกาะเต่า สวรรค์ของนักดำน้ำ อีกหนึ่งสถานที่ท่องเที่ยวยอดนิยมของทั้งชาวไทยและชาวต่างชาติ ขึ้นชื่อในเรื่องธรรมชาติทางทะเลอุดมสมบูรณ์มาก ๆ น้ำทะเลสีฟ้าคราม สัตว์ทะเลหายากและปะการังมากมาย มีเกาะขนาดเล็ก อย่าง นางยวน อยู่ใกล้ ๆ มีสันทรายเชื่อมต่อกับเกาะเต่าอย่างสวยงาม จนเกิดเป็นความมหัศจรรย์ ที่เรารู้จักกันดี เรียกว่า ทะเลแหวก จุดดึงดูดนักท่องเที่ยวให้เข้ามาอย่างไม่ขาดสาย แถมยังเป็นแหล่งดำน้ำดูปะการังที่อุดมสมบูรณ์มาก ๆ อีกตางหาก จนนักท่องเที่ยวร้อยทั้งร้อยต่างพูดเป็นเสียงเดียวกันว่า ที่นี่คือหนึ่งในสถานที่ดำน้ำที่สวยที่สุดของไทย', 'img/img14.png', 10.09566000, 99.84037200, 'เกาะ'),
(23, 'เกาะสมุย', 'เกาะสมุย เป็นเกาะขนาดใหญ่อันดับ 2 รองจากภูเก็ต โดดเด่นมีชื่อเสียงโด่งดังไปทั่วโลก จนได้ฉายาว่า “สวรรค์กลางอ่าวไทย” อุดมสมบูรณ์ไปด้วยทรัพยากรทางธรรมชาติ ท้องทะเลสีฟ้า น้ำใสสะอาด หาดทรายทอดยาว มีแหล่งดำน้ำตื้นทางตอนใต้ของเกาะเป็นสถานที่ยอดนิยมมาก ๆ รวมถึงน้ำตกต่าง ๆ ที่มีน้ำตลอดทั้งปี เรียกได้ว่าเป็นเกาะที่เต็มไปด้วยแหล่งท่องเที่ยวมากมาย', 'img/img15.png', 9.51446300, 100.01282500, 'เกาะ'),
(24, 'เกาะพะงัน', 'เกาะพะงัน ตั้งอยู่ทางตะวันตกเฉียงใต้ของไทย เป็นทะเลอ่าวไทยบริเวณทิศเหนือของเกาะสมุย มีชื่อเสียงโด่งดังระดับโลก จากการจัดงานฟูลมูนปาร์ตี้ทุกคืนที่พระจันทร์เต็มดวง ซึ่งจะจัดขึ้นที่หาดริ้น', 'img/img16.png', 9.73204400, 100.01358200, 'เกาะ'),
(25, 'เกาะแตน', 'เกาะแตน แหล่งท่องเที่ยวเชิงอนุรักษ์ ตั้งอยู่ทางทิศใต้ของเกาะสมุย 5 กิโลเมตร และมีหมู่เกาะอ่างทองตั้งอยู่ทางทิศตะวันตกเฉียงเหนือ บนเกาะปกคลุมไปด้วยป่าไม้ ป่าโกงกาง และสัตว์ป่านานาชนิดอาศัยอยู่ ฝั่งตะวันออก มีชายหาดยาวขนานไปกับแนวประการัง ส่วนฝั่งตะวันตก หาดปิดเป็นป่าชายเลนและหาดหินซะส่วนใหญ่ ซึ่งถือเป็นเกาะที่มีความอุดมสมบูรณ์มากเกาะหนึ่ง มีเส้นทางให้เดินศึกษาธรรมชาติ 4 เส้นทาง นักท่องเที่ยวส่วนใหญ่มักเดินทางมาเพื่อทำกิจกรรมริมทะเล เช่น เล่นน้ำทะเล, นั่งเล่นริมชายหาด, ดำน้ำดูปะการัง,พายเรือ,ขับเจ็ตสกีโต้คลื่น', 'img/img17.png', 9.36921300, 99.94356800, ''),
(26, 'เกาะมัดสุ่ม', 'เกาะมัดสุ่ม หรือ เกาะหมู เกาะส่วนตัวขนาดเล็กที่อยู่ไม่ไกลจากเกาะสมุย ใช้เวลานั่งเรือประมาณ 15 – 25 นาทีก็ถึงแล้ว มีความแคบถึงขนาดสามารถเดินจากฝั่งหนึ่งไปยังอีกฝั่งได้เลย สงบ ลมทะเลพัดเย็นสบาย มีความชิลล์ ท่ามกลางชายหาดสีขาวที่เต็มไปด้วยต้นไม้ใบไม้สีเขียวทั่วเกาะ มีไฮไลต์อยู่ที่ “เจ้าหมู” ที่ใช้ชีวิตเป็นชาวเกาะอยู่ที่นี่ น่ารักและดึงดูดนักท่องเที่ยวได้เป็นอย่างดี โดนตกกันทั้งชาวไทยและชาวต่างชาติ เพราะน้องมีความอวบอ้วนและอุดมสมบูรณ์มาก ๆ เนื่องจากนักท่องเที่ยวมักจะซื้ออาหารให้น้องกินอยู่เป็นประจำ นอกจากนี้บนเกาะยังมีกิจกรรมยอดนิยมอีกมากมาย เช่น นั่งดื่มเครื่องดื่มเย็น ๆ ที่บาร์ริมหาด, ดำน้ำตื้นดูความสวยงามของประการัง, พายเรือคายัค เรือแคนนู, เช่าเจ็ตสกีขับปะทะเกลียวคลื่น หรือ นอนอาบแดดรับลมทะเลชิลล์ ๆ เป็นต้น ใครมาเที่ยวสมุยแนะนำว่าให้มาแวะเที่ยวเกาะมัดสุ่มด้วย รับรองว่าคุ้มค่ากับที่ข้ามมาแน่นอน', 'img/img18.png', 9.36993400, 99.97651200, ''),
(27, 'อุทยานแห่งชาติหมู่เกาะอ่างทอง', 'อุทยานแห่งชาติหมู่เกาะอ่างทอง เป็นอุทยานแห่งชาติทางทะเลแห่งที่สองฝั่งทะเลอ่าวไทยของประเทศไทย ประกอบไปด้วยเกาะต่าง ๆ จำนวนมากถึง 42 เกาะ ที่พีคเลย คือ พึ่งพบวาฬบรูด้าจำนวน 2 ตัว เวียนว่ายหากินอยู่บริเวณด้านทิศตะวันออกของเกาะหว้าใหญ่ แสดงให้เห็นถึงความอุดมสมบูรณ์ของทะเลไทยเรามาก ๆ นอกจากนี้ยังเป็นที่อยู่อาศัยของสัตว์นานาชนิด ทั้งบนบกและในน้ำ สวยงามจนสามารถดำน้ำดูปะการังได้ทุกเกาะ อีกทั้งยังมีสถานที่ท่องเที่ยวอีกมากมายในอานาเขตอุทยานฯ เกาะวัวตาหลับ ที่เต็มไปด้วยชายหาด, จุดชมวิว, เส้นทางศึกษาธรรมชาติ, จุดชมนกเงือกดำและค่างแว่นถิ่นใต้ ที่พบเห็นได้เฉพาะเกาะนี้เท่านั้น ไหนจะเกาะแม่เกาะ ที่มีทะเลสาบสีเขียวมรกตใจกลางเกาะล้อมรอบด้วยพุบเขา และ เกาะหินดับ ที่มีหาดทรายสวยงามและยาวที่สุดในเขตอุทยานฯ เป็นต้น เป็นอีกหนึ่งสถานที่ที่ควรแวะมาชมด้วยตาตัวเองมาก ๆ รับรองเลยว่าสวยตะลึง', 'img/img19.png', 9.63515700, 99.67178200, ''),
(28, 'วัดพระธาตุศิลางู', 'วัดพระธาตุศิลางู หรือ วัดราชธรรมาราม วัดสำคัญของชาวบ้านที่อาศัยอยู่บนเกาะสมุย ซึ่งทุก ๆ ปีทางวัดจะมีจัดงานสมโภชน์และนมัสการพระธาตุ โดดเด่นด้วยอุโบสถสีแดง ประดิษฐานเจดีย์สีทองทั้งองค์หันหน้าเข้าวัด ภายในบรรจุพระบรมสารีริกธาตุศิลางู เจดีย์ถูกสร้างขึ้นโดย หลวงพ่อเพ็ชร์ ติสโส ส่วนองค์พระธาตุได้มาจากการเดินทางไปธุดงค์ที่ศรีลังกา งดงามไปด้วยสถาปัตยกรรมงานแกะสลัก ตั้งอยู่ริมทะเล มีสะพานทอดยาวลงไปบริเวณชายหาด บรรยากาศดีลมพัดเย็นสบาย ส่วนที่มาของชื่อวัดก็ได้มาจากการที่น้ำทะเลบริเวณนี้ลดระดับ แล้วกลุ่มก้อนหินมีลักษณะเป็นลายคล้ายเกร็ดงูนั่นเอง ถือเป็นสถานที่ศักดิ์สิทธิ์ที่มาเที่ยวสมุยแล้ว ไม่ควรพลาดแวะกราบสักการะรับศิริมงคลเช่นกันนะ', 'img/img20.png', 9.45134800, 100.03095900, ''),
(29, 'ป่าต้นน้ำบ้านน้ำราด', 'ป่าต้นน้ำบ้านน้ำราด สถานที่ท่องที่ยวทางธรรมชาติในบ้านน้ำราด จังหวัดสุราษฎร์ธานี เป็นบ่อน้ำที่ผุดขึ้นจากผืนดิน น้ำใสราวกับกระจก มองเห็นพื้นทรายด้านล่าง ความลึกประมาณ 1 เมตร รายล้อมไปด้วยป่าไม้สีเขียวที่มีความอุดมสมบูรณ์ บรรยากาศร่มรื่น ธรรมชาติสุด ๆ สามารถลงเล่นน้ำคลายร้อน, นั่งจุ่มเท้าได้ หรือ จะพายเรือคายัคชมธรรมชาติชิลล์ ๆ ก็น่าสนุก โดยน้ำที่ผุดขึ้นมาจะไหลไปสู่น้ำตกธารทอง ชาวบ้านมีการกั้นน้ำไว้สำหรับให้ลงเล่นได้ แต่ก็มีส่วนที่ลงเล่นไม่ได้ด้วยเช่นกัน ที่นี่มีกฎระเบียบ – ข้อห้าม ซึ่งขอความกรุณาช่วยกันปฏิบัติตามกฎด้วย ช่วยกันรักษาความงดงามของธรรมชาติเอาไว้ให้คงอยู่ต่อไป ช่วงเวลาที่เหมาะกับการมาเที่ยวที่นี่ที่สุด คือ ช่วงเดือนกุมภาพันธ์ – เดือนเมษายนน้า', 'img/img21.png', 8.84243900, 98.96365400, ''),
(30, 'อุโมงค์ต้นจาก คลองร้อยสาย', 'พลาดไม่ได้ กับการนั่งเรือแจว ลอดอุโมงค์ต้นจาก ในคลองร้อยสาย สถานที่ท่องเที่ยวเชิงอนุรักษ์ ในจังหวัดสุราษฎร์ธานี ถือเป็นเสน่ห์อย่างหนึ่งของชุมชนบางใบไม้ ชุมชนริมน้ำที่จะทำให้คุณได้สัมผัสวิธีชีวิตริมคลอง ชาวบ้านที่นี่ส่วนใหญ่ประกอบอาชีพทำสวนมะพร้าว และทำประมง คลองร้อยสาย ชื่อนี้มาจากคลองเล็กคลองน้อยนับร้อยสายเชื่อมต่อกันถึง 6 ตำบล และไหลลงสู่แม่น้ำตาปี ทุกวันอาทิตย์ จะมีตลาดน้ำประชารัฐบางใบไม้ เป็นตลาดริมคลอง มีพื้นที่นั่งพักผ่อน ให้คนในพื้นที่และนักท่องเที่ยวต่างมาเดินเที่ยว ช็อปปิ้ง หาของกิน มีทั้งอาหารคาว อาหารหวาน และผลผลิตจากชาวบ้านตามฤดูกาล ไฮไลท์สำคัญ คือ การนั่งเรือลอดอุโมงค์ต้นจาก สัมผัสวิถีชีวิตชาวบ้าน ที่ริมสองฝั่งคลองเต็มไปด้วยใบจากและพืชน้ำหนาแน่นตลอดทางโค้งเข้าหากันราวกับซุ้มอุโมงค์ยาวหลายร้อยเมตร สวยงามและร่มรื่น น่าประทับใจมาก โดยคุณลุงคุณป้าจะแจวเรือแบบช้า ๆ เพื่อให้เราได้ดื่มด่ำไปกับบรรยากาศอย่างเต็มที่ ใช้เวลาในการล่องเรือ ประมาณ 1 ชั่วโมง ก็ได้ดื่มด่ำธรรมชาติอย่างเต็มปอดแล้ว', 'img/img22.png', 9.15138700, 99.30750500, ''),
(31, 'อุทยานแห่งชาติใต้ร่มเย็น', 'อุทยานแห่งชาติใต้ร่มเย็น ป่าดิบชื้นอุดมสมบูรณ์ท่ามกลางเทือกเขาสลับซับซ้อน ที่ครอบคลุมพื้นที่ถึง 3 อำเภอในสุราษฎร์ มีเนื้อที่รวมกันกว่า 425 ตารางกิโลเมตร เป็นแหล่งต้นน้ำของแม่น้ำตาปีและที่อยู่อาศัยของสัตว์ป่านานาชนิด ยอดเขามีหมอกปกคลุมตลอดทั้งปี จุดเด่นด้านธรรมชาติที่สวยงามของที่นี่ คือ น้ำตกดาดฟ้า น้ำตก 7 ชั้น ที่ใหญ่และสูงที่สุดในจังหวัด ช่วงฤดูฝนน้ำจะไหลแรงเต็มหน้าผาราวกับว่าไหลลงมาจากฝากฟ้า จึงได้ชื่อว่า “ดาดฟ้า” นักท่องเที่ยวนิยมมาลงเล่นน้ำพักผ่อนกันในวันหยุด, ถ้ำเหมก ถ้ำหินปูนที่อยู่อาศัยของผีเสื้อหลวง, ถ้ำขมิ้น ถ้ำหินปูนขนาดใหญ่ ประมาณ 2 กิโลเมตร มีหินงอก หินย้อยสวยงามน่าค้นหา และจุดชมวิวบนยอดเขาที่มีความสวยงาม สามารถมองเห็นวิวธรรมชาติได้แบบพาโนราม่า แถมทางอุทยานฯยังมีบริการด้านที่พักไว้รองรับนักท่องเที่ยวอีกด้วยนะคะ ใครสายลุย สายชิลล์ที่ชอบธรรมชาติ แนะนำเลยค่ะว่ามาแล้วไม่มีผิดหวัง', 'img/img23.png', 8.86316400, 99.47872900, ''),
(32, 'เนินทรายเหมืองแกะ', 'อีกหนึ่งสถานที่ท่องเที่ยวที่เกิดจากธรรมชาติ เนินทรายเหมืองแกะ มีลักษณะเป็นเนื้อละเอียดสีครีมอมชมพู ที่ทับถมสลับทับซ้อนกัน ด้วยความสูงประมาณตึก 3 – 4 ชั้น ท่ามกลางสวนยาง เดิมบริเวณนี้เป็นเหมืองแร่ทรายจำนวนมากจึงถูกกองทับกันเป็นภูเขาไว้เป็นเวลานาน จุดสูงสุดของเนินสามารถชมวิวได้ 360 องศา มองเห็นวิวได้ทั้งหมู่บ้านและธรรมชาติป่าเขา สวยเกินคาดมาก เงียบสงบ มีลมพัดเย็นสบาย ชิลล์ ๆ แถมยังถ่ายรูปออกมาสวยมากอีกตางหาก ได้ฟีลทะเลทรายในต่างประเทศสุด ๆ ความมหัศจรรย์อีกอย่างคือเนื่องจากมันเป็นทราย ในบางบริเวณก็จะมีความลื่นถไลอยู่บ้าง ทำให้เนินทรายแห่งนี้มีลักษณะรูปร่างที่เปลี่ยนแปลงตลอดเวลาตามสภาพอากาศและความอัดแน่น จึงถือเป็นเสน่ห์อีกอย่างของที่นี่ ที่ทำให้นักท่องเที่ยวกลับมาเที่ยวซ้ำ ๆ โดยที่ความรู้สึกที่ได้รับและลักษณะของเนินทรายจะไม่เหมือนเดิมเลยสักครั้งที่กลับมา', 'img/img24.png', 8.82389700, 99.35044600, ''),
(33, 'สะพานแขวนเขาเทพพิทักษ์', 'สะพานแขวนเขาเทพพิทักษ์ หรือ สะพานแขวนเขาพัง จุดชมวิวเขารูปหัวใจ สร้างขึ้นปี พ.ศ.2546 เพื่ออำนวยความสะดวกแก่ชาวบ้านในการขนพืชผลทางการเกษตร ตั้งอยู่บริเวณด้านหลังวัดเขาพังใกล้ ๆ กับทางเข้าเขื่อนรัชชประภา มีลักษณะเป็นสะพานแขวนขึงสลิงขนาดใหญ่ยึดกับเสาคอนกรีตเพื่อใช้ข้ามระหว่างลำธาร ปูพื้นด้วยแผ่นไม้กระดานบนโครงเหล็ก มีระยะทาง 120 เมตร รับน้ำหนักรวมได้ไม่เกิน 20-30 คน รายล้อมไปด้วยภูเขาและป่าสีเขียวขจี มีไฮไลต์เป็นภูเขารูปหัวใจ ที่เกิดขึ้นเองตามธรรมชาติ เมื่ออยู่บนสะพานจะเห็นภูเขาอยู่เยื้องไปทางด้านหลังของตัวสะพานพอดี เป็นความมหัศจรรย์ที่สวยงามมาก เรียกว่าเป็นอันซีนของไทยได้เลยล่ะ หากข้ามสะพานไปอีกฝั่งจะเป็นสวนทุเรียนบ้านคลองแสงที่มีอายุราว 100 ปี', 'img/img25.png', 8.94913100, 98.82247500, ''),
(34, 'อ่างน้ำผุด บางสวรรค์', 'ความมหัศจรรย์ที่ธรรมชาติสร้าง อย่าง อ่างน้ำผุดบางสวรรค์ แหล่งท่องเที่ยวเชิงนิเวศน์ อ่างน้ำจากธรรมชาติที่มีตาน้ำผุดขึ้นมาจากใต้ดินเป็นจำนวนมาก บนเนื้อที่กว่า 179 ไร่ น้ำมีความใสสะอาดจนมองเห็นพื้นทรายด้านล่าง ความลึกอยู่ที่ประมาณ 80 – 150 เซนติเมตร บริเวณใต้แอ่งน้ำเต็มไปด้วยสาหร่ายหางกระรอกและฝูงปลานานาชนิด บางจุดมีตาน้ำผุดมองดูเหมือนน้ำกำลังเดือด ซึ่งก็ถือเป็นจุดขายที่สร้างความตื่นเต้นและความอยากรู้อยากเห็นของนักท่องเที่ยวได้เป็นอย่างดี บริเวณรอบ ๆ น้ำผุดเต็มไปด้วยความร่มรื่นของต้นไม้นานาชนิด และศาลาไว้ให้นั่งพักตามจุดต่าง ๆ นอกจากลงเล่นน้ำจากธรรมชาติกันแล้ว กิจกรรมที่ยอดฮิตอีกอย่าง คือ พายเรือคายัคชมธรรมชาติ บนน้ำใส ๆ ท่ามกลางต้นไม้ที่อุดมสมบูรณ์ มองเห็นปลานานาพันธุ์และนกนานาชนิด มีระยะทางไป – กลับ ประมาณ 3 กิโลเมตร อันนี้แนะนำมากได้ออกกำลังกายไปในตัว แถมยังสนุกสุด ๆ อีกด้วย', 'img/img26.png', 8.67304300, 98.97976200, ''),
(35, 'เกาะราฮัม', 'เกาะที่ไม่ใช่เกาะ กับ เกาะราฮัม บีชคลับ แหลมที่ยื่นลงสู่ทะเลริมหาดสน บนเกาพะงัน ที่ไม่ว่าจะอาหาร, ขนม, เครื่องดื่ม หรือแอลกอฮอล์ก็มีครบ บรรยากาศก็คือดีสุด ๆ จุดหมายปลายทางยอดนิยมของนักท่องเที่ยวที่เดินทางมาเกาะพะงัน การตกแต่งร้านก็น่ารักมาก ฟีลกระท่อมริมทะเล บาหลีดี ๆ นี่เอง มุมถ่ายรูปก็คือจุก ๆ จะถ่ายกับร้านก็สวย เดินลงไปถ่ายริมทะเลก็เลิศ ใครจะโดดลงเล่นน้ำ หรือ นอนเปลพักผ่อนฟังเสียงคลื่นชิลล์ ๆ ก็ทำได้เช่นกันนะ อีกอย่างคือการชมพระอาทิตย์ตกที่นี่สวยมาก ที่สุดของจุดชมพระอาทิตย์ตกบนเกาะพะงันเลยล่ะแม่เอ๋ย อันนี้แนะนำมากรับรองว่า มาแล้วมีกิจกรรมสนุก ๆ ให้ทำทั้งวันแน่นอน', 'img/img27.png', 9.77208400, 99.96151200, ''),
(36, 'เขื่อนรัชชประภา', 'เขื่อนรัชชประภา (มีความหมายว่า แสงสว่างแห่งอาณาจักร) หรือที่ผู้คนมักรู้จักกันดีในชื่อ เชี่ยวหลาน ตั้งอยู่ในอุทยานแห่งชาติเขาสก เขื่อนอเนกประสงค์แห่งที่สองของภาคใต้ มีลักษณะเป็นเขื่อนหินถมแกนดินเหนียวแห่งสุดท้ายที่กฟผ.สร้างขึ้น เพื่อปิดกั้นลำน้ำคลองแสง ด้วยความสูง 94 เมตร สันเขื่อนยาว 761 เมตร ทัศนียภาพโดยรอบเขื่อน คือ สวยงามมาก น้ำใสสีมรกต มองเห็นตัวปลาและมีภูเขาหินปูนสูงโผล่พ้นน้ำมากมาย มักมีหมอกลอยคละคลุงชะง่อนผา บวกกับผืนน้ำสีเขียวและท้องฟ้าสีฟ้าสดใส เกิดเป็นภาพธรรมชาติอันสวยสดงดงามเกินจะบรรยาย สมกับฉายา กุ้ยหลินเมืองไทย เลยล่ะ\r\nหากมาเที่ยวจังหวัดสุราษฎร์นี่ถือเป็นสถานที่ที่ไม่ควรพลาดเลยล่ะ อีกทั้งภายในยังมีแพริมน้ำหลายเจ้า ให้คนที่สนใจอยากจะค้างแรมในบรรยากาศธรรมชาติ มีกิจกรรมให้ทำเพียบ อาทิ ล่องเรือ, ดูถ้ำปะการัง, เล่นน้ำ, พายเรือคายัค ฯลฯ อีกทั้งยังมีถ้ำที่สวยงามน่าค้นหาและเต็มไปด้วยสัตว์ป่าหายากมากมาย มาพักผ่อนที่นี่ คือ ได้ผ่อนคลายท่ามกลางธรรมชาติอย่างแท้จริง เพราะแทบไม่มีสัญญาณมือถือเลย เหมาะมากสำหรับคนที่อยากหลีกหนีความวุ่นวายมาพักกายพักใจ', 'img/img28.png', 8.97244300, 98.80571000, ''),
(37, 'เขาสามเกลอ', 'เขาสามเกลอ ที่เที่ยวยอดฮิตที่ต้องมาเช็คอินเมื่อมาเที่ยว เขื่อนเชี่ยวหลาน นั่นเอง ความสวยงามของที่นี่ได้รับ ขนานนามว่าเป็น กุ้ยหลินเมืองไทย เพราะมี ภูเขาหินกลางน้ำ ตั้งเรียงตัวกัน 3 อัน กลางเขื่อนเชี่ยวหลาน ทำให้เป็นทัศนีภาพที่สวยงามมากๆ  อีกทั้งยังมีบรรยากาศอันงดงามของหมอก และทะเลสาบ ที่นี่จึงกลายเป็นแหล่งท่องเที่ยวยอดนิยมอีกแห่งหนึ่งของไทยเลยทีเดียว\r\n\r\n', 'img/img29.png', 8.99671500, 98.70917900, ''),
(38, 'ถ้ำปะการัง', 'ถ้ำปะการัง สถานที่สุด Unseen ภายในเขาสก หรือ อุทยานแห่งชาติเขาสก ความพิเศษของถ้ำแห่งนี้คือจะมีน้ำไหลผ่านตลอด และมีหินงอกหินย้อยที่แตกเป็นหน่อเล็กๆ ซึ่งคาดว่าเกิดมาจากการตกตะกอนของน้ำหินปูน ที่เมื่อผสมเข้ากับความพิเศษของอากาศจึงเกิดเป็นหินย้อยที่มีลักษณะคล้ายกับปะการังในทะเล นอกจากนี้ยังมีการค้นพบ ฟอสซิลสัตว์ทะเลเซลล์เดียวอายุกว่า 250-400 ล้านปี ในหินปูนอีกด้วย เป็นมหัศจรรย์ธรรมชาติที่มีความเก่าแก่และหาชมได้ยากมากเลยทีเดียว', 'img/img30.png', 9.11422200, 98.72383500, ''),
(39, 'หินตา หินยาย เกาะสมุย', 'มาถึงจุดถ่ายรูปสวย ไฮไลท์บนเกาะสมุยกันบ้าง ตามเรามาเช็คอินกันที หินตา หินยาย ค่ะ โขดหินขนาดใหญ่ที่ตั้งอยู่ริมหาดละไม เกิดขึ้นจากปรากฎการณ์ที่ธรรมชาติ บวกกับจินตนาการที่มองเป็นรูปต่างๆ ของชาวบ้าน และนักท่องเที่ยว ทำให้ที่นี่เป็นอีกจุดถ่ายรูปบนเกาะสมุยที่มีนักท่องเที่ยวมากันเยอะมากทีเดียว', 'img/img31.png', 9.45215300, 100.03953900, ''),
(40, 'เกาะวัวตาหลับ', 'เกาะวัวตาหลับ เป็นอีกหนึ่ง เกาะสวย สุราษฎร์ธานี ที่น่าไปเที่ยวไม่น้อยไปกว่าที่อื่นๆ เลย เพราะมีที่มีหาดทรายขาว ทรายเนียนละเอียด และเหมาะกับการเล่นน้ำ ทำให้นักท่องเที่ยวส่วนใหญ่นิยมมาดำน้ำดูปะการัง เล่นน้ำทะเลใสๆ กันค่ะ อีกทั้งบนเกาะยังมี ถ้ำบัวโบก ถ้ำสวยที่มีหินงอกหินย้อย ให้ได้เที่ยวชม และมี จุดชมวิวผาจันทร์จรัส ที่สวยงาม ต้องไปถ่ายรูปสักครั้งนั่นเอง', 'img/img32.png', 9.62446400, 99.67494900, ''),
(41, 'ทะเลใน', 'ทะเลใน ทะเลสาบกลางภูเขาแสนสวยบน เกาะแม่เกาะ ที่เกิดจากแอ่งหินปูนยุบตัวลงในทะเล เป็นวงรี กว้างกว่า 250 เมตร ยาว 350 เมตร และลึก 7 เมตร บริเวณใกล้ๆ ทะเลในจะมีจุดชมวิว ที่สามารถเห็นวิวของน้ำทะเลสีเขียวมรกต รายล้อมไปด้วยภูเขาเขียวขจีอย่างชัดเจน', 'img/img33.png', 9.65589800, 99.66588500, ''),
(42, 'เกาะสามเส้า', 'เกาะสามเส้า เป็นส่วนหนึ่งของ อุทยานแห่งชาติหมู่เกาะอ่างทอง ที่มีแหล่งปะการังที่ค่อนข้างสมบูรณ์ และชายหาดสีขาวสะอาดตา เหมาะกับการมาเล่นน้ำ พายเรือคายัค และดำน้ำชมปะการัง อีกทั้งยังมีไฮไลท์เป็น สะพานหินธรรมชาติ ยื่นโค้งออกไปในทะเล เป็นแลนด์มาร์คถ่ายรูปที่ไม่ควรพลาด นอกจากนี้ยังมี จุดชมวิวเกาะสามเส้า ที่สามารถเห็นวิวทั่วทั้งเกาะได้แบบกว้างไกล', 'img/img34.png', 9.65963600, 99.68213400, ''),
(43, 'น้ำตกดาดฟ้า', 'น้ำตกดาดฟ้า ตั้งอยู่ใน อุทยานแหงชาติใต้ร่มเย็น ตำบลลำพูน อำเภอบ้านนาสาร ค่ะ ที่นี่มีน้ำตกที่สูงใหญ่ ตั้งสง่าอยู่กลางป่าเขา ทางอุทยานได้แบ่งออกเป็น 7 ชั้นด้วยกัน ซึ่งส่วนใหญ่จะไปแวะพักเล่นน้ำกันที่ชั้น 3 เนื่องจากมีแอ่งน้ำขนาดใหญ่อยู่นั่นเอง ใครที่อยากเที่ยวธรรมชาติสดชื่นสุดๆ แวะมาเที่ยวกันได้', 'img/img35.png', 8.86316300, 99.47901300, ''),
(44, 'วัดธารน้ำไหล สวนโมกขพลาราม', 'วัดธารน้ำไหล หรือที่เรารู้จักกันในชื่อ สวนโมกขพลาราม ตั้งอยู่ที่เขาพุทธทอง อำเภอไชยา จังหวัดสุราษฎร์ธานีค่ะ ซึ่งจัดตั้งโดยท่านพุทธทาสภิกขุ เมื่อ พ.ศ.2502 เพื่อเป็นสถานที่แสวงหาความสงบและศึกษาธรรมนั่นเอง', 'img/img36.png', 9.35970800, 99.17012700, ''),
(45, 'เกาะแรต', 'เกาะแรต เป็นชุมชนเกาะเล็กๆ ที่อยู่ท่ามกลางธรรมชาติ มีบ้านเรือนที่อยู่อาศัยเพียง 90 ครัวเรือน ตั้งอยู่ริมทะเลรอบเกาะ ผู้คนส่วนใหญ่จะทำอาชีพประมง และปรับปรุงบ้านเรือนต่างๆ ให้เป็นที่พักโฮมเสตย์รองรับนักท่องเที่ยว เหมาะกับการมาเที่ยวเล่น พักผ่อนในบรรยากาศเงียบสงบ สัมผัสวิถีชีวิตของชาวเกาะ', 'img/img37.png', 9.33077100, 99.70359800, ''),
(46, 'หาดนางกำ', 'หาดนางกำ ชายหาดสวยที่ทอดยาวคู่ขานไปกับน้ำทะเลสีฟ้า สามารถมองเห็นวิวของภูเขา และเกาะน้อยใหญ่ได้จากบริเวณชายหาด นอกจากจะเป็นพื้นที่ป่าเขา และป่าชายเลน บริเวณหาดนางกำยังอบอวลไปด้วยวิถีชีวิตของชาวประมงพื้นบ้าน และชาวสวนมะพร้าว รวมถึงเป็นจุดลงเรือเที่ยวทะเลชมโลมาสีชมพู และไปเกาะใกล้ๆ ฝั่งภายในพื้นที่ของอุทยานแห่งชาติหมู่เกาะทะเลใต้ได้อีกด้วย', 'img/img38.png\r\n', 9.31587200, 99.75597100, ''),
(47, 'เซ็นทรัลสุราษฎร์ธานี', 'เป็นศูนย์การค้าใหญ่ในจังหวัดสุราษฎร์ธานี โดยมีลักษณะเป็นแหล่งรวมร้านค้า ร้านอาหาร และสิ่งอำนวยความสะดวกต่าง ๆ ที่ตอบโจทย์สำหรับทั้งคนท้องถิ่นและนักท่องเที่ยว', 'img/img39.png', 9.10982300, 99.30238000, 'ห้าง'),
(48, 'เซ็นทรัลสมุย', 'เป็นศูนย์การค้าขนาดใหญ่ที่ตั้งอยู่บนเกาะสมุย จังหวัดสุราษฎร์ธานี โดยถือเป็นแหล่งช้อปปิ้งและพักผ่อนยอดนิยมของนักท่องเที่ยวทั้งชาวไทยและชาวต่างชาติ', 'img/img40.png', 9.53223800, 100.06083800, 'ห้าง'),
(49, 'สหไทยการ์เด้น พลาซ่า สุราษฎร์ธานี', 'เป็นศูนย์การค้าเก่าแก่และสำคัญในจังหวัดสุราษฎร์ธานี มีความโดดเด่นในฐานะห้างสรรพสินค้าที่รองรับความต้องการของคนในพื้นที่และนักท่องเที่ยว', 'img/img41.png', 9.14914700, 99.33587700, 'ห้าง'),
(50, 'บิ๊กซี ซูเปอร์เซ็นเตอร์ สุราษฎร์ธานี', 'บิ๊กซี ซูเปอร์เซ็นเตอร์ สุราษฎร์ธานี เป็นหนึ่งในสาขาของเครือห้างค้าปลีกบิ๊กซี ที่ให้บริการสินค้าหลากหลายประเภทในราคาย่อมเยา โดยเป็นจุดหมายที่ตอบโจทย์การช้อปปิ้งของทั้งคนในพื้นที่และนักเดินทาง\r\n\r\n', 'img/img42.png', 9.14820200, 99.36978400, ''),
(51, 'Lamune Cafe\nละมุน คาเฟ่', 'ละมุนคาเฟ่เป็นร้านเล็กๆน่ารักๆ บรรยากาศดี ตกแต่งสวย นั่งสบายๆ ใต้หอพัก M&M Apartment ในซอยพิเศษ ใกล้โซนมหาลัย ราคาก็เบาๆสบายกระเป๋ามานั่งคุย นั่งเม้าท์ นั่งเล่นชิวๆก็ได้หมด เจ้าของก็ใจดีเป็นคอฟฟี่เลิฟเวอร์ สายฮาเฮ ชานมหอม ขนมอร่อย แนะนำให้มาลอง ', 'img/img43.png', 9.09104900, 99.35997900, 'คาเฟ่'),
(52, 'The Copper Cafe', 'The Copper - Suratthani เป็นร้านอาหารหรือคาเฟ่ที่ตั้งอยู่ในจังหวัดสุราษฎร์ธานี โดยอาจมีบรรยากาศที่เน้นความเป็นเอกลักษณ์และโดดเด่น ซึ่งมักเป็นที่รู้จักในด้านการตกแต่งสไตล์โมเดิร์นหรือมีความอบอุ่นเหมาะสำหรับการนั่งพักผ่อน', 'img/img44.png', 9.14651100, 99.32647200, ' คาเฟ่');

-- --------------------------------------------------------

--
-- Table structure for table `favorites`
--

CREATE TABLE `favorites` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `place_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tourist_spots`
--

CREATE TABLE `tourist_spots` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `image_url` varchar(255) NOT NULL,
  `latitude` decimal(10,8) NOT NULL,
  `longitude` decimal(11,8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tourist_spots`
--

INSERT INTO `tourist_spots` (`id`, `name`, `description`, `image_url`, `latitude`, `longitude`) VALUES
(1, 'อุทยานธรรมเขานาในหลวง', 'เป็นที่ตั้งของ เจดีย์ลอยฟ้า พระพุทธศิลาวดี ก่อสร้างด้วยศิลาแลงจากเมืองกำแพงเพชร บนยอดเขาหินปูนจะอยู่สูงจากพื้นดินเกือบ 300 เมตร เป็นสถานที่ศักดิ์สิทธิ์ที่สงบและร่มเย็นอย่างมาก และชาวสุราษฎร์เองก็ให้ความศรัทธามากๆ อีกด้วย อีกทั้งยังมี ซุ้มประตูพุทธวดี 9 ยอด ที่หากโดนแสงอาทิตย์ส่องลอดเข้ามา จะยิ่งสวยงามมากๆ ทีเดียวเลย', 'img/img3.png', 8.77800700, 98.95512900),
(2, 'วัดพระบรมธาตุไชยา', 'เป็นปูชนียสถานที่สำคัญประจำจังหวัด และเป็นหนึ่งในสามของโบราณสถานอันศักดิ์สิทธิ์ ที่เคารพบูชาของภาคใต้อีกด้วย', 'img/img4.png', 9.38472700, 99.18489600),
(3, 'ศาลหลักเมือง', 'ศาลหลักเมืองสุราษฎร์ธานี มีความโดดเด่นมาก เพราะตั้งอยู่ใจกลางเมืองใกล้กับแม่น้ำตาปี การเดินทางไปมาสะดวก ทั้งผู้คนที่สัญจรไปมาและชาวจังหวัดสุราษฎร์ธานีที่จะเดินทางมาสักการะด้วย', 'img/img11.png', 9.13912100, 99.32166500),
(4, 'เกาะเต่า', 'เกาะเต่า สวรรค์ของนักดำน้ำ อีกหนึ่งสถานที่ท่องเที่ยวยอดนิยมของทั้งชาวไทยและชาวต่างชาติ ขึ้นชื่อในเรื่องธรรมชาติทางทะเลอุดมสมบูรณ์มาก ๆ น้ำทะเลสีฟ้าคราม สัตว์ทะเลหายากและปะการังมากมาย มีเกาะขนาดเล็ก อย่าง นางยวน อยู่ใกล้ ๆ มีสันทรายเชื่อมต่อกับเกาะเต่าอย่างสวยงาม จนเกิดเป็นความมหัศจรรย์ ที่เรารู้จักกันดี เรียกว่า ทะเลแหวก จุดดึงดูดนักท่องเที่ยวให้เข้ามาอย่างไม่ขาดสาย แถมยังเป็นแหล่งดำน้ำดูปะการังที่อุดมสมบูรณ์มาก ๆ อีกตางหาก จนนักท่องเที่ยวร้อยทั้งร้อยต่างพูดเป็นเสียงเดียวกันว่า ที่นี่คือหนึ่งในสถานที่ดำน้ำที่สวยที่สุดของไทย', 'img/img14.png', 10.09566000, 99.84037200),
(5, 'เกาะสมุย', 'เกาะสมุย เป็นเกาะขนาดใหญ่อันดับ 2 รองจากภูเก็ต โดดเด่นมีชื่อเสียงโด่งดังไปทั่วโลก จนได้ฉายาว่า “สวรรค์กลางอ่าวไทย” อุดมสมบูรณ์ไปด้วยทรัพยากรทางธรรมชาติ ท้องทะเลสีฟ้า น้ำใสสะอาด หาดทรายทอดยาว มีแหล่งดำน้ำตื้นทางตอนใต้ของเกาะเป็นสถานที่ยอดนิยมมาก ๆ รวมถึงน้ำตกต่าง ๆ ที่มีน้ำตลอดทั้งปี เรียกได้ว่าเป็นเกาะที่เต็มไปด้วยแหล่งท่องเที่ยวมากมาย', 'img/img15.png', 9.51446300, 100.01282500),
(6, 'เกาะพะงัน', 'เกาะพะงัน ตั้งอยู่ทางตะวันตกเฉียงใต้ของไทย เป็นทะเลอ่าวไทยบริเวณทิศเหนือของเกาะสมุย มีชื่อเสียงโด่งดังระดับโลก จากการจัดงานฟูลมูนปาร์ตี้ทุกคืนที่พระจันทร์เต็มดวง ซึ่งจะจัดขึ้นที่หาดริ้น', 'img/img16.png', 9.73204400, 100.01358200),
(7, 'ป่าต้นน้ำบ้านน้ำราด', 'ป่าต้นน้ำบ้านน้ำราด สถานที่ท่องที่ยวทางธรรมชาติในบ้านน้ำราด จังหวัดสุราษฎร์ธานี เป็นบ่อน้ำที่ผุดขึ้นจากผืนดิน น้ำใสราวกับกระจก มองเห็นพื้นทรายด้านล่าง ความลึกประมาณ 1 เมตร รายล้อมไปด้วยป่าไม้สีเขียวที่มีความอุดมสมบูรณ์ บรรยากาศร่มรื่น ธรรมชาติสุด ๆ สามารถลงเล่นน้ำคลายร้อน, นั่งจุ่มเท้าได้ หรือ จะพายเรือคายัคชมธรรมชาติชิลล์ ๆ ก็น่าสนุก โดยน้ำที่ผุดขึ้นมาจะไหลไปสู่น้ำตกธารทอง ชาวบ้านมีการกั้นน้ำไว้สำหรับให้ลงเล่นได้ แต่ก็มีส่วนที่ลงเล่นไม่ได้ด้วยเช่นกัน ที่นี่มีกฎระเบียบ – ข้อห้าม ซึ่งขอความกรุณาช่วยกันปฏิบัติตามกฎด้วย ช่วยกันรักษาความงดงามของธรรมชาติเอาไว้ให้คงอยู่ต่อไป ช่วงเวลาที่เหมาะกับการมาเที่ยวที่นี่ที่สุด คือ ช่วงเดือนกุมภาพันธ์ – เดือนเมษายนน้า', 'img/img21.png', 8.84243900, 98.96365400),
(8, 'อุทยานแห่งชาติใต้ร่มเย็น', 'อุทยานแห่งชาติใต้ร่มเย็น ป่าดิบชื้นอุดมสมบูรณ์ท่ามกลางเทือกเขาสลับซับซ้อน ที่ครอบคลุมพื้นที่ถึง 3 อำเภอในสุราษฎร์ มีเนื้อที่รวมกันกว่า 425 ตารางกิโลเมตร เป็นแหล่งต้นน้ำของแม่น้ำตาปีและที่อยู่อาศัยของสัตว์ป่านานาชนิด ยอดเขามีหมอกปกคลุมตลอดทั้งปี จุดเด่นด้านธรรมชาติที่สวยงามของที่นี่ คือ น้ำตกดาดฟ้า น้ำตก 7 ชั้น ที่ใหญ่และสูงที่สุดในจังหวัด ช่วงฤดูฝนน้ำจะไหลแรงเต็มหน้าผาราวกับว่าไหลลงมาจากฝากฟ้า จึงได้ชื่อว่า “ดาดฟ้า” นักท่องเที่ยวนิยมมาลงเล่นน้ำพักผ่อนกันในวันหยุด, ถ้ำเหมก ถ้ำหินปูนที่อยู่อาศัยของผีเสื้อหลวง, ถ้ำขมิ้น ถ้ำหินปูนขนาดใหญ่ ประมาณ 2 กิโลเมตร มีหินงอก หินย้อยสวยงามน่าค้นหา และจุดชมวิวบนยอดเขาที่มีความสวยงาม สามารถมองเห็นวิวธรรมชาติได้แบบพาโนราม่า แถมทางอุทยานฯยังมีบริการด้านที่พักไว้รองรับนักท่องเที่ยวอีกด้วยนะคะ ใครสายลุย สายชิลล์ที่ชอบธรรมชาติ แนะนำเลยค่ะว่ามาแล้วไม่มีผิดหวัง', 'img/img23.png', 8.86316400, 99.47872900),
(9, 'สะพานแขวนเขาเทพพิทักษ์', 'สะพานแขวนเขาเทพพิทักษ์ หรือ สะพานแขวนเขาพัง จุดชมวิวเขารูปหัวใจ สร้างขึ้นปี พ.ศ.2546 เพื่ออำนวยความสะดวกแก่ชาวบ้านในการขนพืชผลทางการเกษตร ตั้งอยู่บริเวณด้านหลังวัดเขาพังใกล้ ๆ กับทางเข้าเขื่อนรัชชประภา มีลักษณะเป็นสะพานแขวนขึงสลิงขนาดใหญ่ยึดกับเสาคอนกรีตเพื่อใช้ข้ามระหว่างลำธาร ปูพื้นด้วยแผ่นไม้กระดานบนโครงเหล็ก มีระยะทาง 120 เมตร รับน้ำหนักรวมได้ไม่เกิน 20-30 คน รายล้อมไปด้วยภูเขาและป่าสีเขียวขจี มีไฮไลต์เป็นภูเขารูปหัวใจ ที่เกิดขึ้นเองตามธรรมชาติ เมื่ออยู่บนสะพานจะเห็นภูเขาอยู่เยื้องไปทางด้านหลังของตัวสะพานพอดี เป็นความมหัศจรรย์ที่สวยงามมาก เรียกว่าเป็นอันซีนของไทยได้เลยล่ะ หากข้ามสะพานไปอีกฝั่งจะเป็นสวนทุเรียนบ้านคลองแสงที่มีอายุราว 100 ปี', 'img/img25.png', 8.94913100, 98.82247500);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `name` varchar(255) NOT NULL,
  `role` enum('user','admin') NOT NULL DEFAULT 'user'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `created_at`, `name`, `role`) VALUES
(1, 'songsongsong2209@gmail.com', '12345', '2025-01-05 10:58:35', 'Kunat', 'user'),
(2, 'aum@gmail.com', 'aaaa1', '2025-01-05 11:00:29', 'aaaaa', 'user'),
(3, 'ii@gmail.com', '123', '2025-01-05 14:18:05', 'll', 'user'),
(4, 'admin@gmail.com', '123', '2025-01-05 14:18:05', 'admin', 'admin'),
(15, 'jj@gmail.com', '11', '2025-01-09 15:31:53', 'jj', 'user'),
(16, 'AA@gmail.com', '123', '2025-01-14 16:38:47', 'aumm', 'user');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_favorite` (`user_id`,`place_id`);

--
-- Indexes for table `tourist_spots`
--
ALTER TABLE `tourist_spots`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT for table `favorites`
--
ALTER TABLE `favorites`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tourist_spots`
--
ALTER TABLE `tourist_spots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
